ИС_СПОРТ_2022/src/InformationRegisters/СоставыСемейСпортсменов/СоставыСемейСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставыСемейСпортсменов</name>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/СоставыСемейСпортсменов/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		Если Параметры.Свойство("Спортсмен") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Спортсмен", Параметры.Спортсмен, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Спортсмен = Параметры.Спортсмен; 
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоВыбор") Тогда
		Для Каждого Команда Из ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы Цикл
			Если НЕ Команда.Имя = "СписокВыбрать"  Тогда
				Команда.Видимость = Ложь;
			КонецЕсли;	
		КонецЦикла;
	Иначе
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.СписокВыбрать.Видимость = Ложь; 
		

	КонецЕсли;	
	
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздать.Видимость = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(Спортсмен) Тогда
		Отказ = Истина;
		//ОткрытьФорму("РегистрСведений.СоставыСемейСпортсменов.ФормаЗаписи",Новый Структура("Спортсмен",Спортсмен));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	СтруткураВозврат = Новый Структура("Родитель");
	Если НЕ ТекДанные = Неопределено Тогда
		СтруткураВозврат.Родитель = ТекДанные.Родитель;
	КонецЕСли;
	
	ЭтаФорма.Закрыть(СтруткураВозврат);
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ОбработкаОповещения = Новый ОписаниеОповещения("ФормаО", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.СоставыСемейСпортсменов.ФормаЗаписи",Новый Структура("Спортсмен",Спортсмен),,,,,ОбработкаОповещения);
КонецПроцедуры

&НаКлиенте
Функция ФормаО(текст,форма) экспорт
     этотобъект.ТекущийЭлемент.Обновить();
    
КонецФункции;
